src/buoyantBoussinesqSIMPLE-Scalar-LADSource-V2/system/sampleScalars
// -*- C++ -*-

type                sets;
libs                (sampling);
interpolationScheme cellPoint;
setFormat           raw;

writeControl        writeTime;

fields
(
    T
    p_rgh
    k
    ObukhovLength
    Ustar
);

sets
{
    lineZ1
    {
        type        midPoint;
        axis        z;
        start       (0 0 0);
        end         (0 0 6);
        nPoints     200;
    }
}


// *********************************************************************** //
